In [2]:
import pandas as pd
import numpy as np

In [52]:
cars = pd.read_csv("cha08_datas/used_cars.csv")

cars.head(10)

  Manufacturer  Year Fuel Transmission  Price
0        Acura  2012  Gas    Automatic  10299
1       Jaguar  2011  Gas    Automatic   9500
2        Honda  2004  Gas    Automatic   3995
3    Chevrolet  2016  Gas    Automatic  41988
4          Kia  2015  Gas    Automatic  12995
5    Chevrolet  2014  Gas    Automatic  10995
6          BMW  2011  Gas    Automatic   8995
7       Toyota  2007  Gas    Automatic   3995
8       Toyota  2005  Gas    Automatic   8995
9       Nissan  2008  Gas    Automatic   7995

In [53]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 460466 entries, 0 to 460465
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Manufacturer  444356 non-null  object
 1   Year          460466 non-null  int64
 2   Fuel          457733 non-null  object
 3   Transmission  457183 non-null  object
 4   Price         460466 non-null  int64
dtypes: int64(2), object(3)
memory usage: 17.6+ MB

In [54]:
cars["Fuel"].unique()

array(['Gas', 'Diesel', nan, 'Other', 'Hybrid', 'Electric'], dtype=object)

In [55]:
cars["Fuel"] = cars["Fuel"].fillna("NaN Value")

In [56]:
cars["Fuel"].unique()

array(['Gas', 'Diesel', 'NaN Value', 'Other', 'Hybrid', 'Electric'],
      dtype=object)

In [57]:
cars.nunique()

Manufacturer       41
Year               21
Fuel                6
Transmission        3
Price           18103
dtype: int64

In [58]:
cars["Transmission"] = cars["Transmission"].fillna("NaN Value")

In [59]:
cars["Transmission"].unique()

array(['Automatic', 'NaN Value', 'Manual', 'Other'], dtype=object)

In [60]:
cars["Fuel"] = cars["Fuel"].astype(dtype="category")

In [61]:
cars["Transmission"] = cars["Transmission"].astype(dtype="category")

In [62]:
cars["Manufacturer"] = cars["Manufacturer"].astype(dtype="category")

In [63]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 460466 entries, 0 to 460465
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Manufacturer  444356 non-null  category
 1   Year          460466 non-null  int64
 2   Fuel          460466 non-null  category
 3   Transmission  460466 non-null  category
 4   Price         460466 non-null  int64
dtypes: category(3), int64(2)
memory usage: 8.3 MB

In [65]:
cars.nunique()

Manufacturer       41
Year               21
Fuel                6
Transmission        4
Price           18103
dtype: int64

In [77]:
cars["Fuel"].dtype

CategoricalDtype(categories=['Diesel', 'Electric', 'Gas', 'Hybrid', 'NaN Value', 'Other'], ordered=False, categories_dtype=object)

In [67]:
cars.pivot_table(
    index="Fuel",
    values=["Price"],
    aggfunc="sum",
    observed=False,
)

                 Price
Fuel
Diesel       986177143
Electric      18502957
Gas        86203853926
Hybrid        44926064
NaN Value     49030574
Other        242096286

In [69]:
cars.pivot_table(
    index="Manufacturer",
    values=["Price"],
    columns="Transmission",
    aggfunc="count",
    fill_value=0,
    margins=True,
    margins_name="Total",
    observed=False,
)

                    Price
Transmission    Automatic Manual NaN Value  Other   Total
Manufacturer
Acura                3443    141        13     48    3645
Alfa-Romeo             50      0         0     11      61
Aston-Martin           20      5         1      0      26
Audi                 4974    375        32     69    5450
BMW                 11641    774        46    627   13088
Buick                6187     17        10    265    6479
Cadillac             6357     74        26    406    6863
Chevrolet           61006   1820       179   4255   67260
Chrysler             7553    133        20    212    7918
Dodge               14338    626        72    991   16027
Ferrari                29      4         0      9      42
Fiat                  435    220         8    187     850
Ford                75980   2979       554   3505   83018
GMC                 19504    137        56    939   20636
Harley-Davidson       115     61        17     10     203
Hennessey               0      1         0      0       1
Honda               20666   1502       261    921   23350
Hyundai             10350    544        48    334   11276
Infiniti             3555    185        46     76    3862
Jaguar                882     29         3     50     964
Jeep                17687   2316       158   1385   21546
Kia                  7615    466        43    587    8711
Land Rover             23      0         0      0      23
Lexus                5573     30        49    226    5878
Lincoln              3001     10         9     51    3071
Mazda                4127    746        19    649    5541
Mercedes-Benz        9599     74        53     98    9824
Mercury              1437     15         2      2    1456
Mini                 1411    712        12    138    2273
Mitsubishi           2064    247        43     52    2406
Nissan              22262    858       712   1429   25261
Pontiac              2710    213         4     28    2955
Porche                  9      1         0      0      10
Ram                 19996    837       168   1243   22244
Rover                1752      9        10     24    1795
Saturn               1451    152         4     12    1619
Subaru               8317   1884       220    420   10841
Tesla                 179      0         0     59     238
Toyota              31480   1367       256   2134   35237
Volkswagen           7985   1286        28    236    9535
Volvo                2665    155         3     50    2873
Total              398428  21005      3185  21738  444356

In [72]:
cars.pivot_table(
    index=["Year", "Fuel"],
    values=["Price"],
    columns=["Transmission"],
    aggfunc="mean",
    fill_value=0,
    observed=False,
)

                       Price
Transmission       Automatic        Manual     NaN Value         Other
Year Fuel
2000 Diesel     11326.176962  14010.164021  10654.166667  11075.000000
     Electric    1500.000000      0.000000      0.000000      0.000000
     Gas         4314.675996   6226.140327   6311.833333   3203.538462
     Hybrid      2600.000000   2400.000000      0.000000      0.000000
     NaN Value   7394.000000   2975.000000   1995.000000      0.000000
...                      ...           ...           ...           ...
2020 Electric    8015.166667   2200.000000  31991.000000  20247.500000
     Gas        34925.857933  36007.270833  12984.500000  20971.045455
     Hybrid     35753.200000      0.000000      0.000000   1234.000000
     NaN Value  58360.000000      0.000000      0.000000      0.000000
     Other      22210.306452      0.000000  17888.000000   2725.925926

[123 rows x 4 columns]

In [74]:
cars.pivot_table(
    index=["Year", "Fuel"],
    values=["Price"],
    columns="Transmission",
    aggfunc="mean",
    fill_value=0,
    observed=False,
).stack(future_stack=True).head(20)

                                    Price
Year Fuel      Transmission
2000 Diesel    Automatic     11326.176962
               Manual        14010.164021
               NaN Value     10654.166667
               Other         11075.000000
     Electric  Automatic      1500.000000
               Manual            0.000000
               NaN Value         0.000000
               Other             0.000000
     Gas       Automatic      4314.675996
               Manual         6226.140327
               NaN Value      6311.833333
               Other          3203.538462
     Hybrid    Automatic      2600.000000
               Manual         2400.000000
               NaN Value         0.000000
               Other             0.000000
     NaN Value Automatic      7394.000000
               Manual         2975.000000
               NaN Value      1995.000000
               Other             0.000000

In [75]:
min_wage = pd.read_csv("cha08_datas/minimum_wage.csv")

min_wage.head()

        State  2010  2011  2012  2013  2014  2015   2016   2017
0     Alabama  0.00  0.00  0.00  0.00  0.00  0.00   0.00   0.00
1      Alaska  8.90  8.63  8.45  8.33  8.20  9.24  10.17  10.01
2     Arizona  8.33  8.18  8.34  8.38  8.36  8.50   8.40  10.22
3    Arkansas  7.18  6.96  6.82  6.72  6.61  7.92   8.35   8.68
4  California  9.19  8.91  8.72  8.60  9.52  9.51  10.43  10.22

In [19]:
min_wage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   55 non-null     object
 1   2010    55 non-null     float64
 2   2011    55 non-null     float64
 3   2012    55 non-null     float64
 4   2013    55 non-null     float64
 5   2014    55 non-null     float64
 6   2015    55 non-null     float64
 7   2016    55 non-null     float64
 8   2017    55 non-null     float64
dtypes: float64(8), object(1)
memory usage: 4.0+ KB

In [76]:
year_columns = [
    "2010", "2011", "2012", "2013",
    "2014", "2015", "2016", "2017",
]

min_wage.melt(id_vars="State", value_vars=year_columns, var_name="Year", value_name="Wage")

             State  Year   Wage
0          Alabama  2010   0.00
1           Alaska  2010   8.90
2          Arizona  2010   8.33
3         Arkansas  2010   7.18
4       California  2010   9.19
..             ...   ...    ...
435       Virginia  2017   7.41
436     Washington  2017  11.24
437  West Virginia  2017   8.94
438      Wisconsin  2017   7.41
439        Wyoming  2017   5.26

[440 rows x 3 columns]